pages/about/index.html
<!DOCTYPE html>
<html prefix="" lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width">
<title>About John: | Mortis Acadame</title>
<link href="../../assets/css/all.css" rel="stylesheet" type="text/css">
<link rel="stylesheet" href="//fonts.googleapis.com/css?family=PT+Serif:400,400italic,700%7CPT+Sans:400">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="https://millejoh.github.io/MortisAcadame/pages/about/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="John M. Miller">
<meta property="og:site_name" content="Mortis Acadame">
<meta property="og:title" content="About John:">
<meta property="og:url" content="https://millejoh.github.io/MortisAcadame/pages/about/">
<meta property="og:description" content="Being a Chemical Engineer


Writing, analysis, planning, team leading.



Commissioning, instrumentation, troubleshooting.



Technology - Instrumentation, Controls, Platforming, Isomerization, Olefle">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2020-05-21T12:53:33-06:00">
</head>
<body>
    <a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>
    <!-- Target for toggling the sidebar `.sidebar-checkbox` is for regular
            styles, `#sidebar-checkbox` for behavior. -->
    <input type="checkbox" class="sidebar-checkbox" id="sidebar-checkbox"><!-- Toggleable sidebar --><div class="sidebar" id="sidebar">
        <div class="sidebar-item">
            <p>A reserved <a href="https://getnikola.com" target="_blank">Nikola</a> theme that places the utmost gravity on content with a hidden drawer. Made by <a href="https://twitter.com/mdo" target="_blank">@mdo</a> for Jekyll,
            ported to Nikola by <a href="https://twitter.com/ralsina" target="_blank">@ralsina</a>.</p>
        </div>
        
    <nav id="menu" role="navigation" class="sidebar-nav"><a class="sidebar-nav-item" href="../../">Home</a>
        <a class="sidebar-nav-item" href="../../pages">Essays</a>
        <a class="sidebar-nav-item" href="../../archive.html">Archive</a>
        <a class="sidebar-nav-item" href="../../categories/">Tags</a>
        <a class="sidebar-nav-item" href="../../rss.xml">RSS feed</a>
        <a class="sidebar-nav-item" href=".">About</a>
    
    
    </nav>
</div>

    <!-- Wrap is the content to shift when toggling the sidebar. We wrap the
         content to avoid any CSS collisions with our real content. -->
    <div class="wrap">
      <div class="masthead">
        <div class="container">
          
    <h3 id="brand" class="masthead-title">
      <a href="https://millejoh.github.io/MortisAcadame/" title="Mortis Acadame" rel="home">Mortis Acadame</a>
    </h3>

        </div>
      </div>

      <div class="container content" id="content">
        
<article class="post-text storypage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="post-title p-name entry-title" itemprop="headline name"><a href="." class="u-url">About John:</a></h1>

        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-orgb0e2e5d" class="outline-2">
<h2 id="orgb0e2e5d">Being a Chemical Engineer</h2>
<div class="outline-text-2" id="text-orgb0e2e5d">
<p>
Writing, analysis, planning, team leading.
</p>

<p>
Commissioning, instrumentation, troubleshooting.
</p>

<p>
Technology - Instrumentation, Controls, <a href="https://www.uop.com/processing-solutions/refining/gasoline/#naphtha-reforming">Platforming</a>, <a href="https://www.uop.com/processing-solutions/refining/gasoline/#naphtha-isomerization">Isomerization</a>, <a href="https://www.uop.com/processing-solutions/petrochemicals/olefins/#butylenes">Oleflex
(C4=)</a>, Merox (<a href="https://www.uop.com/processing-solutions/refining/gas-lpg-treating/#gas-treating">Extraction</a> &amp; <a href="https://www.uop.com/processing-solutions/refining/gasoline/#naphtha-treating">Sweetening</a>), <a href="https://www.uop.com/processing-solutions/refining/gasoline/#alkylation">HF Alkylation</a>, <a href="https://www.uop.com/processing-solutions/refining/vgo-fuel-oil-conversion/#fcc">FCC</a>. I'll eventually add
Hydrocracking to the list, if given enough time and motivation. Also, the
discerning reader should be able to divine who I work for.
</p>

<p>
Salesforce.
</p>
</div>
</div>

<div id="outline-container-orgc83c26a" class="outline-2">
<h2 id="orgc83c26a">Dabbling in Computer Science</h2>
<div class="outline-text-2" id="text-orgc83c26a">
<p>
Python, Common Lisp, emacs lisp.
</p>

<p>
<a href="https://github.com/millejoh/emacs-ipython-notebook">Emacs IPython Notebook</a> - Once maintainer, now silent user. Responsible for
migrating support from IPython 1.0 to 2.0 and beyond. Over 1k stars and over
150k (!) downloads from <a href="https://melpa.org/#/?q=ein">MELPA</a>.
</p>

<p>
Contributed to <a href="https://github.com/ahyatt/emacs-websocket">emacs-websocket</a>.
</p>

<p>
Long, long ago (1999-2000) I ported a very early version of <a href="http://clsql.kpe.io/manual/">clsql</a> to Lispworks
(some may recognize the irony in this since clsql was an open source
implementation of the Lispworks <a href="http://www.lispworks.com/documentation/sql-tutorial/">Common SQL</a> api).
</p>

<p>
Unpublished - Python interface to Uniformance PHD using COM. Python interface to Outlook.
</p>
</div>
</div>

<div id="outline-container-orgec90c54" class="outline-2">
<h2 id="orgec90c54">Writing Mortis Acadame</h2>
<div class="outline-text-2" id="text-orgec90c54">
<p>
All true education must begin with the premise that one day the student will
die.
</p>
</div>
</div>
    </div>
    

</article><footer id="footer"><p>Contents © 2020         <a href="mailto:millejoh@mac.com">John M. Miller</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         </p>
            
        </footer>
</div>
    </div>
    <label for="sidebar-checkbox" class="sidebar-toggle"></label>
    
    
    
            <script src="../../assets/js/all-nocdn.js"></script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
